{
  "checkpoint_number": 4,
  "agent": "physical_description",
  "status": "awaiting_approval",
  "output": {
    "narrative": "# MAYA CHEN: PHYSICAL PRESENCE PROFILE\n\n## NARRATIVE\n\nMaya Chen moves through the world as though she's always processing spatial data—her body a precise instrument calibrated for observation rather than expression. There's an economy to her physicality; nothing is wasted, nothing is accidental. Her default state is a controlled alertness: shoulders slightly drawn back (not rigid, but held with intention), spine maintaining a subtle curve that suggests both readiness and the weight of constant analysis. She walks with a measured, efficient stride—not hurried, but purposeful—each step landing with quiet precision as though she's mentally cataloging the acoustic properties of every surface. Her feet strike heel-first, a grounded approach that keeps her center of gravity low and stable, making her harder to knock off balance (literally and metaphorically). This isn't the posture of someone who trusts the world; it's the posture of someone who expects it to shift and has positioned herself to absorb the impact.\n\nHer hands are rarely still, but not in an anxious way—they're tools for thinking. When processing information or working through a problem, her fingers will trace invisible patterns in the air, as if drawing the connections she sees in data. She touches her compass necklace frequently, a self-soothing gesture that's become so habitual she's often unaware she's doing it, the small silver disc rotating between her thumb and forefinger like a talisman against chaos. In conversation, she maintains careful control over her gestures; they're precise and minimal, reflecting her compartmentalized approach to emotion. But when she's excited about a discovery or genuinely engaged with an idea, her hands become more animated—her fingers splaying to illustrate concepts, her palms turning upward in rare moments of openness. The moment she catches herself doing this, however, there's a visible recalibration; she pulls back, re-establishing her emotional perimeter.\n\nHer relationship with space is fundamentally about control and escape. She positions herself with exits always in her peripheral vision—a habit so ingrained she doesn't consciously think about it anymore. She maintains a larger personal boundary than most people, not from shyness but from a need to maintain autonomy. When someone breaches this space without permission, her entire body tightens almost imperceptibly; her breathing becomes shallower, her jaw subtly clenches. In moments of genuine fear or when her trust has been violated, her physical presence becomes almost ghostlike—she makes herself smaller, her movements become nearly silent, as though she's trying to become invisible. Conversely, when she's in analytical mode or pursuing a lead, she expands slightly; her posture straightens, her movements become more deliberate, and there's a focused intensity in how she occupies space that can be almost intimidating. This is Maya at her most confident: when she's solving a puzzle, when the world briefly aligns with her need for pattern and order.\n\n## STRUCTURED\n\n```json",
    "structured": {
      "mannerisms": [
        "Compulsively rotates her silver compass necklace between thumb and forefinger, particularly when processing difficult information or experiencing internal conflict. The gesture is almost meditative, a tactile anchor to her belief in hidden order. When stressed, the rotation becomes faster, more agitated.",
        "Scans room exits and entrance points within seconds of entering any space—a quick, practiced sweep of her eyes that maps escape routes. This happens so automatically that people rarely notice, but it's a constant baseline behavior reflecting her deep need for control and her fear of being trapped.",
        "Traces invisible geometric patterns in the air with her fingertips when working through complex problems or analyzing data—drawing connections, mapping relationships, visualizing probability trees. Her fingers move like she's conducting an invisible orchestra of information.",
        "Tilts her head slightly to the left when skeptical or when someone's explanation doesn't align with her analysis. It's a subtle gesture that signals her analytical mind is actively questioning, cross-referencing, looking for inconsistencies.",
        "Pauses mid-sentence when she catches herself becoming emotionally expressive, creating a visible moment of self-correction where she re-establishes her intellectual frame. Her eyes will briefly look inward before refocusing, and she'll often restart her sentence in more measured, analytical language.",
        "Touches the inside of her wrist (where her pulse is) with her opposite hand's thumb when anxious or when experiencing moments of panic—a grounding technique that keeps her connected to her own physical reality and her heartbeat, a tangible proof that she exists and is present."
      ],
      "body_language": "Maya's default posture is upright but not rigid—a controlled vertical alignment that suggests both confidence and constant vigilance. Her shoulders are held with deliberate ease, positioned slightly back and down, creating an open chest that contradicts the guardedness in her eyes. Her spine maintains a subtle S-curve that allows her to move fluidly between states; she can shift from relaxed to coiled in seconds without obvious physical tells. Her head is typically held level or with a slight forward tilt when concentrating, giving her an analytical, observational quality. Her facial expression is characteristically neutral—not cold, but carefully modulated. Her eyes are her most expressive feature; they're sharp and intelligent, constantly scanning and processing, with a quality of searching intensity that makes people feel simultaneously seen and analyzed.\n\nWhen seated, Maya sits with her back against something (wall, chair back) whenever possible, never in the middle of a space. She sits forward on chairs rather than relaxing back into them, maintaining a state of readiness. Her legs are often crossed at the ankle rather than the knee, a position that allows her to stand quickly. Her hands rest on her lap or on a table surface, rarely dangling or exposed.\n\nIn moments of genuine emotional connection or vulnerability, her posture softens almost imperceptibly—her shoulders drop slightly, her breathing becomes more visible, and there's a quality of openness that contradicts her usual guardedness. But this state is brief; she catches herself and re-establishes her boundaries. When triggered by betrayal or having her intelligence questioned, her entire body becomes very still—an eerie, predatory stillness where all her energy seems to concentrate inward. Her jaw tightens, her breathing becomes controlled and measured, and her eyes take on a cold, analytical quality. This is the moment before she executes a decision with surgical precision.\n\nWhen experiencing helplessness or confronting meaninglessness, her physical presence becomes almost fragmented—she might pace in tight circles, her movements becoming less coordinated, her usual precision breaking down. This is when she's most dangerous because her carefully maintained compartmentalization is failing.",
      "movement_style": "Maya moves with quiet efficiency, each gesture purposeful and economical. Her walking stride is measured and controlled—not rushed, but not leisurely. She walks heel-first with a steady rhythm, her arms swinging in a natural but slightly constrained arc. Her movement through space is almost predatory in its awareness; she flows around obstacles rather than bumping into them, suggesting constant spatial mapping. She rarely hurries unless pursuing a specific objective, in which case her pace increases incrementally rather than suddenly, maintaining her air of control.\n\nHer gestures when speaking are minimal and precise. She uses her hands primarily to illustrate logical concepts—pointing to show cause-and-effect, splaying fingers to show multiple variables, making cutting motions to show separation between ideas. She rarely uses expansive gestures; her communication is contained within a smaller radius around her body. However, when genuinely excited about a discovery or when her analytical mind is fully engaged, her hand movements become more fluid and animated, her fingers moving with more freedom. The moment she becomes aware of this expressiveness, there's a visible contraction—her hands return to her lap or her sides, and her verbal communication becomes more precise and less gestural.\n\nIn moments of stress or anxiety, her movements become either very slow and deliberate (as she forces herself to maintain control) or restless and repetitive (pacing, fidgeting with her necklace, rearranging objects). She has a tendency to move to windows or toward exits when anxious, drawn to the idea of escape even if she doesn't consciously intend to leave. Her physical energy level is moderate and consistent—not hyperactive, but not languid. She's always in a state of readiness, her body never fully relaxed, even in supposedly safe environments. This creates an undercurrent of tension in her physical presence that people often sense without being able to articulate it.",
      "physical_quirks": [
        "Arranges objects in precise geometric patterns when stressed or thinking through complex problems—aligning books on a table, straightening papers, organizing items by size or color. This is a compulsive behavior rooted in her childhood need to create order from her father's chaos after his stroke. The act of physical organization helps her organize her thoughts.",
        "Holds her breath slightly when receiving new information, as though she's pausing to process before responding. This creates a micro-moment of stillness that makes her seem more thoughtful than she might otherwise appear. It's a physical manifestation of her analytical pause.",
        "Cracks her knuckles or interlocks her fingers with gentle pressure before making a difficult decision or entering a confrontation—a self-preparation ritual that centers her and signals (to herself) that she's about to execute a planned action rather than react emotionally.",
        "Avoids direct eye contact when experiencing genuine emotion or vulnerability, instead focusing on objects (her necklace, her hands, a point slightly past the person's shoulder). This is her physical tell for emotional discomfort; when she's in analytical mode, her eye contact is intense and unwavering.",
        "Tends to mirror the body language of people she trusts (unconsciously adopting their posture or gestures) while maintaining visible distance from people she's skeptical of. This is a contradiction in her psychology—her body betrays a desire for connection even as her mind maintains boundaries. She would be horrified to realize she does this."
      ]
    }
  },
  "metadata": {
    "wave": 2,
    "timestamp": "2025-11-09T06:29:59.512920",
    "tokens_used": 1400,
    "agent_time_seconds": 17.240676666666666
  }
}