{
  "checkpoint_number": 3,
  "agent": "voice_dialogue",
  "status": "awaiting_approval",
  "output": {
    "narrative": "# THE MAN: VOICE & DIALOGUE PROFILE\n\n## NARRATIVE DESCRIPTION\n\nThe Man's voice is a study in controlled compression—words emerge clipped and deliberate, as though each syllable costs him something precious. He speaks like someone rationing fuel: no wasted breath, no ornamental language, just the essential architecture of meaning. His sentences fragment mid-thought, not from confusion but from a mind that operates in parallel tracks—the surface layer speaking while the deeper layer runs threat assessments, calculates distances, inventories supplies. There's a military precision underlying his speech, though whether from formal training or simply the discipline required to survive is unclear; either way, it manifests as a preference for imperative statements, conditional logic, and the language of tactical assessment. His voice carries an undercurrent of gravel—not from age but from disuse, from nights spent silent in hiding, from screaming that burned something out of him long ago. He speaks in the present tense almost exclusively, as though the past is a locked room he cannot afford to enter, and the future too uncertain to conjugate into being.\n\nWhat distinguishes The Man's speech most acutely is the tension between his external control and internal fracture. He can execute formal, almost courteous phrasing when circumstances demand it—a remnant of whoever he was before the burning—but this formality feels like a mask he puts on and removes with visible effort. Beneath it lives a more volatile register: short, brutal sentences that tumble out when emotion breaches his defenses. He uses silence as punctuation, holding pauses so long they become almost accusatory, forcing others to fill the void or sit in discomfort. His vocabulary is deliberately economical—he avoids abstractions, preferring concrete nouns and active verbs—yet occasionally a more complex word surfaces, suggesting an education that trauma has simplified but not erased. Crucially, The Man speaks very little about himself; he deflects personal questions through redirection or terseness, and when he does speak of his own experience, the language becomes fragmented, almost dissociative, as though describing someone else's life.\n\nHis speech patterns shift dramatically under pressure. When threatened or cornered, his words become even more sparse, almost telegraphic—subject-verb-object stripped to its skeleton. When vulnerable (a rare state), his speech develops a halting quality; he fumbles for words, backtracks, contradicts himself, the facade of control visibly splintering. Humor, when it appears, is dark and self-directed, a way of acknowledging the absurdity of survival without fully surrendering to despair. He rarely laughs; instead, his mouth tightens into something that might be a smile but reads as grimace. Most distinctively, The Man has learned to listen more than speak—not from politeness but from survival instinct. He gathers information through silence, watches for tells in others' voices, and speaks only when strategic or when emotion overwhelms his carefully maintained dam.\n\n---\n\n## STRUCTURED PROFILE\n\n```json",
    "structured": {
      "speech_pattern": "Terse and fragmented with underlying military precision. The Man favors short, declarative sentences punctuated by meaningful silences. His speech accelerates under stress and fragments into near-telegraphic phrases. In calmer moments, longer sentences emerge, but they remain architecturally spare—no flourish, no digression. He speaks in present tense almost exclusively, treating past as inaccessible and future as speculative. Sentence structure varies deliberately: sometimes complete and formal (revealing his pre-trauma education), more often broken into functional units. His rhythm is deliberate and measured, with strategic pauses that create discomfort and force others to fill silence. Regional accent is minimal, suggesting either careful erasure or pre-war cosmopolitan background; what remains is the flattened affect of someone who has trained themselves to be unremarkable. In moments of crisis, his voice drops to near-whisper; in rare moments of connection, it carries surprising warmth before he catches himself and retreats.",
      "verbal_tics": [
        "Repeats 'Keep moving' (literal and metaphorical—the mantra of survival)",
        "Uses 'Listen' as conversational anchor when demanding attention or clarity",
        "Default filler: extended silence rather than verbal fillers; when he does pause-fill, uses 'Right' or 'Mm' rather than 'um' or 'like'",
        "Habit of conditional phrasing: 'If we...', 'When we...', 'Assuming...', 'Provided that...' (reflects hypervigilant threat-assessment)",
        "Self-interruption mid-thought with sharp head-shake or hand gesture when emotion threatens to surface",
        "Tendency to end statements with questions that aren't really questions: 'We move now, yes?' or 'You understand?' (maintains control while checking for compliance)"
      ],
      "vocabulary": "Economical and concrete. The Man favors simple, direct nouns (fire, water, road, stone) and active verbs (move, find, survive, take). He avoids abstract concepts and emotional language, though these occasionally slip through when his guard drops. His vocabulary suggests working-class or military background overlaid with fragments of formal education—he can deploy more sophisticated language when necessary (he'll use 'provisions' instead of 'food' in formal contexts, 'expedient' instead of 'quick' when tactical clarity matters), but these words feel borrowed, not native to his current speech. Technical language appears when discussing survival mechanics: navigation terms, weather assessment, injury assessment. Slang is minimal and never casual—it surfaces as a tool, not as comfort. He uses few contractions ('won't' instead of 'will not' feels too committal; he prefers the fuller form), which reinforces his sense of formal distance. Profanity is sparse and devastating when it appears—not reflexive cursing but surgical deployment of obscenity to punctuate genuine extremity.",
      "sample_dialogue": {
        "confident": "Rome is three days' march if the road holds and we move before dawn. I've navigated worse terrain. We move now.",
        "vulnerable": "I... there was a woman. A child. I couldn't—I kept moving because stopping meant... meant knowing what I'd left behind. Don't ask me to explain it.",
        "stressed": "Fire. Behind us. Move. Now. Don't question—move. Grab what you can carry, nothing more. We have minutes. Go.",
        "sarcastic": "Yes, let's stop and rest here. Very sensible. I'm sure the soldiers will wait politely while we catch our breath."
      }
    }
  },
  "metadata": {
    "wave": 2,
    "timestamp": "2025-11-09T19:19:48.810260",
    "tokens_used": 1600,
    "agent_time_seconds": 14.393645999999999
  }
}